# ------------------------------------------------------------------

# 15 задание ЕГЭ. Алгебра логики.

# ------------------------------------------------------------------

# 1:52:42
# vkvideo.ru/video-205865487_456239697

# def f(x):
#     return (x&a!=0)<=(((x&17==0)and(x&5==0))<=(x&3!=0))
# for a in range(100):
#     if all(f(x) == 1 for x in range(10000)):
#         print(a)

# 23

# ------------------------------------------------------------------

# 12:25
# vkvideo.ru/video-205865487_456240494

# def f(x):
#     return ((x%19!=0)or(x%15!=0)) <= (x%a!=0)
# for a in range(1,10000):
#     if all(f(x)==1 for x in range(1,1000000)):
#         print(a)
#         bre 
# 285

# ------------------------------------------------------------------

# 14:39

# def f(x):
#     return ((x%12==0)<=(x%90!=0))or (x+2*a>=512)
# for a in range(1,10000):
#     if all(f(x)==1 for x in range(1,1000000)):
#         print(a)
#         break

# 166

# ------------------------------------------------------------------

# 16:23

# def f(x):
#     return (x%a == 0) or ((70<=x<=80)<= (x%18!=0))
# for a in range(10000,1,-1):
#     if all(f(x)==1 for x in range(1,100000)):
#         print(a) 
#         break

# 72

# ------------------------------------------------------------------

# 22:15

# def f(x):
#     return (a%35==0)and((730%x==0)<=((a%x!=0)<=(110%x!=0)))
# cnt = 0
# for a in range(1,1001):
#     if all(f(x)==1 for x in range(1,1000000)):
#         cnt += 1
# print(cnt)

# 14

# ------------------------------------------------------------------

# 24:30

# def f(x):
#     return(x&29!=0)<=((x&12==0)<=(x&a!=0))
# for a in range(1,1000):
#     if all(f(x)==1 for x in range(1000000)):
#         print(a)
#         break

# 17

# ------------------------------------------------------------------

# 26:00

# def f(x):
    # return((x&673!=0)or(x&189!=0))<=(x&a>0)
# for a in range(1,1000):
    # if all(f(x)==1 for x in range(10**6)):
        # print(a)
        # break

# 701

# ------------------------------------------------------------------

# 30:00

# def f(x,y):
#     return(x*y<3*a)or (x>=31) or(x<5*y)
# for a in range(1,1000):
#     if all(f(x,y) == 1 for x in range(1,1000) for y in range(1,1000)):
#         print(a)
#         break

# 61

# ------------------------------------------------------------------

# 34:40

# def f(x,y):
#     return (x+2*y>a)or(y<x)or(x<30)
# for a in range(1000,1,-1):
#     if all(f(x,y)==1 for x in range(1000)for y in range(1000)):
#         print(a)
#         break

# 89

# ------------------------------------------------------------------

# 38:00

# def f(x,y):
#     return (x>=27)or(2*x<3*y)or(a>(x+2)*(y-3))
# for a in range(1000):
#     if all(f(x,y)==1 for x in range(1000) for y in range(1000)):
#         print(a)
#         break 

# 393

# ------------------------------------------------------------------

# 40:30 

# def poz(n,m):
#     return n-m>0

# def f(x,y):
#     return not poz(x+y,73) or not poz(37,x-y) or poz(y,a)
# for a in range(1000,1,-1):
#     if all(f(x,y)==1 for x in range(1000)for y in range(1000)):
#         print(a)
#         break

# 18

# ------------------------------------------------------------------

# 47:14
  
# def tr(n,m,k):
#     return n+m>k and n+k>m and m+k>n # Формула треугольника
# def f(x):
#     return(tr(a,7,x))<=((max(x+5,14)<=27) == (not tr(36,21,x)))
# for a in range(1000,1,-1):
#     if all(f(x)==1 for x in range(1,10**6)):
#         print(a)
#         break

# 50

# ------------------------------------------------------------------

# 1:07:44

# def f(x):
#     P = 2<=x<=20
#     Q = 15<=x<=25
#     A = a1<=x<=a2
#     return ((not A)<=(not P)) or Q

# ox = [dx for x in (2,15,20,25) for dx in (x,x+0.1,x-0.1)]

# m = []
# for a1 in ox:
#     for a2 in ox:
#         if a2>=a1 and all(f(x)==1 for x in ox):
#             m.append(a2-a1)
# print(min(m))

# Округляем в большую сторону
# 13

# ------------------------------------------------------------------

# 1:13:40

# def f(x):
#     P = 10<=x<=29
#     Q = 13<=x<=18
#     A = a1<=x<=a2
#     return (A<=P)or Q
# ox = [dx for x in(10,29,13,18)for dx in (x,x-0.01,x+0.01)]

# m = []
# for a1 in ox:
#     for a2 in ox:
#         if a2>=a1 and all(f(x)==1 for x in ox):
#             m.append(a2-a1)
# print(max(m))

# 19

# ------------------------------------------------------------------

# 1:17:00

# def f(x):
#     P = 135<=x<=218
#     Q = 174<=x<=308
#     R = 246<=x<=382
#     A = a1<=x<=a2
#     return (not(Q<=(P or R))) <= ((not(A))<= (not(Q)))

# ox = [dx for x in(135,218,174,308,246,382)for dx in (x,x+0.001,x-0.001)]
# m=[]
# for a1 in ox:
#     for a2 in ox:
#         if a2>=a1 and all(f(x)==1 for x in ox):
#             m.append(a2-a1)
# print(min(m))

# 28

# ------------------------------------------------------------------

# 1:20:00

# def f(x):
#     B = 36<=x<=75
#     C = 60<=x<=110
#     A = a1<=x<=a2
#     return (not A) <=(B==C)
# ox = [dx for x in(36,75,60,110)for dx in (x,x+0.0001,x-0.0001)]
# m = []
# for a1 in ox: 
#     for a2 in ox: 
#         if a2>=a1 and all(f(x)==1 for x in ox):
#             m.append(a2-a1)
# print(min(m))

# 74

# ------------------------------------------------------------------

                        # Множества
            # (Крайне редко встречается на ЕГЭ)

# ------------------------------------------------------------------

# 1:28:30
# Поиск минимального множества

# a = set()

# def f(x):
#     P = x in {2,4,6,8,10,12,14,16,18,20}
#     Q = x in {3,6,9,12,15,18,21,24,27,30}
#     A = x in a
#     return (P<=A) or ((not A)<=(not Q))
# for x in range(1,1000):
#     if f(x)==0:
#         print(x)

# 3

# ------------------------------------------------------------------

# 1:35:00
# Поиск максимального множества

# a = set(range(1,1000))
# def f(x):
#     P = x in {2,4,6,8,10,12,14,16,18,20}
#     Q = x in {5,10,15,20,25,30,35,40,45,50}
#     A = x in a
#     return (A<=P) or ((not Q) <= (not A))
# for x in range(1 ,1000):
#     if f(x)== 0:
#         a.remove(x)
# print(len(a))

# 18

# ------------------------------------------------------------------

# 1:46:00

# def f(x):
#     return(a%5==0) and ((2020%a!=0)<=((x%1718==0)<=(2023%a==0)))

# for a in range(1,10000):
#     if all(f(x)==1 for x in range(1,10**7)):
#         print(a)

#  6

# ------------------------------------------------------------------

# 1:52:00

# from itertools import *

# a = set()

# def f(x):
#     P = x[0]+x[1] =="11"
#     Q = x[-1]=="0"
#     A = x in a
#     return (not A) <= (P or (not Q))
# for x in product("01",repeat=8):
#     if f(x)==0:
#         a.add(x)
# print(len(a))

# 96

# ------------------------------------------------------------------

# 1:55:00

# a = set(range(-1000,1000))
# def f(x):
#     B = x in {-42,-10,-8,2,16}
#     C = x in {-10,-4,2,15,23}
#     A = x in a
#     return (A <= B) or C
# for x in range(-1000,1000):
#     if f(x)==0:
#         a.remove(x)
# print(a)
# print(2+15+16+23)

# 56

# ------------------------------------------------------------------